//************************************************************************************
// 
// 編集者：伊地田真衣
// 
//************************************************************************************
// 背景描画 [bg.h]
#ifndef __BG_H__
#define __BG_H__
#include "main.h"

class Texture;

//===========================
//
//	クラス定義
//
//===========================
class BG {
public:
	BG();
	~BG();

	HRESULT Init();	// 初期化
	void Uninit();	// 終了処理
	void Update();	// 更新
	void Draw();		// 描画
private:
	static std::unique_ptr<Texture> pBG;
};
#endif