#include "SceneManager.h"
#include "Scene.h"
#include "Title.h"
#include "Game.h"
#include "Result.h"
#include "Fade.h"

//-------------------- グローバル変数定義 --------------------
eSCENE SceneManager::nextScene = SCENE_NONE;

//====================================================================================
//
//				コンストラクタ
//
//====================================================================================
SceneManager::SceneManager() {
}

//====================================================================================
//
//				デストラクタ
//
//====================================================================================
SceneManager::~SceneManager() {
}

//====================================================================================
//
//				初期化
//
//====================================================================================
void SceneManager::Init() {
	// 最初はタイトル画面
	nowScene = nextScene = SCENE_TITLE;
	pNowScene = std::make_shared<Title>();

	pFade = std::make_shared<Fade>();
}

//====================================================================================
//
//				終了
//
//====================================================================================
void SceneManager::Uninit() {
	SetScene(SCENE_NONE);	// 現在の画面を終了

	pNowScene.reset();

	pFade.reset();
}

//====================================================================================
//
//				更新
//
//====================================================================================
void SceneManager::Update() {
	if (nowScene != nextScene) {
		ChangeScene();
	}

	pNowScene->Update();

	pFade->Update();

}

//====================================================================================
//
//				描画
//
//====================================================================================
void SceneManager::Draw() {	
	pNowScene->Draw();
	pFade->Draw();
}

//====================================================================================
//
//				次のシーンをセット
//
//====================================================================================
void SceneManager::SetScene(eSCENE eScene) {
	nextScene = eScene;
}

//====================================================================================
//
//				シーン番号取得
//
//====================================================================================
eSCENE SceneManager::GetScene() {
	return nextScene;
}


//====================================================================================
//
//				切り替え
//
//====================================================================================
void SceneManager::ChangeScene() {
	pNowScene->Uninit();

	switch (nextScene) {
	case SCENE_TITLE:		// タイトル画面
		pNowScene.reset();	// メモリ切り替えの為破棄
		pNowScene = std::make_shared<Title>();
		break;
	case SCENE_GAME:		// ゲーム画面
		pNowScene.reset();	// メモリ切り替えの為破棄
		pNowScene = std::make_shared<Game>();
		break;
	case SCENE_RESULT:		// リザルトシーン
		pNowScene.reset();	// メモリ切り替えの為破棄
		pNowScene = std::make_shared<Result>();
		break;
	default:
		break;
	}

	pNowScene->Init();

	nowScene = nextScene;
}
