//************************************************************************************
// 
// 編集者：伊地田真衣
// 
//************************************************************************************
#ifndef __SCENE_H__
#define __SCENE_H__

//-------------------- インクルード部 --------------------
#include "main.h"

//-------------------- クラス定義 --------------------
class Scene {
public:
	//---変数
	Scene();
	virtual ~Scene();

	virtual void Init();			// 初期化
	virtual void Uninit();			// 終了処理
	virtual void Update();			// 更新
	virtual void Draw();			// 描画
};

#endif
